package com.tian.myweather.data

/**
 * @Author: tian7
 * @Email: 253493510@qq.com
 * @Date: on 2024/7/13: 20: 43
 * @Description: 城市id和名称的映射，本人懒，只取一部分
 */
object CityMap {
    private val cityMap = mapOf(
        "101010100" to "北京",// 北京市
        "101020100" to "上海",// 上海市
        "101030100" to "天津", // 天津市
        "101040100" to "重庆", // 重庆市
        "101200101" to "武汉", // 湖北省
        "101250101" to "长沙", // 湖南省
        "101280101" to "广州", // 广东省
//        "101300101" to "南宁", // 广西壮族自治区
//        "101260101" to "贵阳", // 贵州省
//        "101310101" to "海口", // 海南省
//        "101050101" to "哈尔滨", // 黑龙江省
//        "101080101" to "呼和浩特", // 内蒙古自治区
//        "101320101" to "香港", // 香港特别行政区
        "101180101" to "郑州", // 河南省
        "101060101" to "长春", // 吉林省
        "101190101" to "南京", // 江苏省
        "101240101" to "南昌", // 江西省
        "101070101" to "沈阳", // 辽宁省
        "101050311" to "西安", // 陕西省
//        "101330101" to "澳门", // 澳门特别行政区
//        "101170101" to "银川", // 宁夏回族自治区
//        "101150101" to "西宁", // 青海省
//        "101270101" to "成都", // 四川省
//        "101120101" to "济南", // 山东省
//        "101160101" to "兰州", // 甘肃省
//        "101130101" to "乌鲁木齐", // 新疆维吾尔自治区
//        "101140101" to "拉萨", // 西藏自治区
    )

    fun getCityMap(): Map<String, String> {
        return cityMap
    }

    fun getCityById(id: String): String? {
        return cityMap[id]
    }
}